{
   "projects": [
      {
         "title": "Projet Intégrateur - Conception de système embarqué",
         "description": "Configurer un microcontrôleur ATmega324A en C avec des makefiles pour contrôler un robot et valider son comportement avec le simulateur SimulIDE.",
         "keyWords": ["SimulIDE", "C", "Makefile"],
         "image": "",
         "video": "",
         "lienUrl": "",
         "start": "2021-01",
         "end": "2021-04",
         "ecole": "Polytechnique Montréal",
         "tasks": [
            "Travailler en équipe de 4 pour résoudre une problématique complexe",
            "Maîtriser le fonctionnement de l'application SimulIDE",
            "Vérifier si le comportement correspond aux attentes définies par la problématique",
            "Se partager les tâches selon les fonctionnalités demandés ainsi que les dépendances entre eux"
         ]
      },
      {
        "title": "Projet intégrateur – Conception d’une application web",
        "description": "Créer un jeu de Scrabble (backend et frontend) permettant de faire des parties multijoueur ou contre l’ordinateur.",
        "keyWords": ["TypeScript", "Angular", "WebSocket", "MongoDB"],
        "image": "",
        "video": "Projet développement Web.mkv",
        "lienUrl": "https://polytechnique-montr-al.gitlab.io/log2990/20221/equipe-305/log2990-305/#/home",
        "start": "2022-01",
        "end": "2022-04",
        "ecole": "Polytechnique Montréal",
        "tasks": [
            "Réaliser le projet en utilisant TypeScript, Angular, CSS, MongoDB et des WebSockets",
            "Travailler en équipe de 6 selon la méthodologie Agile en utilisant GitLab",
            "Concevoir l'interface utilisateur avec Figma pour faciliter son implémentation",
            "Définir les tâches à accomplir en fonction de leur difficulté et des compétences des coéquipiers",
            "Écrire des tests unitaires et des tests de régression pour valider l’ensemble du projet sur GitLab"
        ]
      },
      {
        "title": "Projet intégrateur - Conception d'une application mobile (Android)",
        "description": "Adapter le projet de conception web réalisé l'année précédente en version mobile en ajoutant de nouvelles fonctionnalités.",
        "keyWords": ["Dart", "Flutter", "WebSocket", "MongoDB", "Angular", "Typescript", "Jenkins", "Playwright"],
        "image": "",
        "video": "Projet développement mobile.mp4",
        "lienUrl": "https://github.com/jammy312/Projet-integrateur-Polytechnique",
        "start": "2023-01",
        "end": "2023-04",
        "ecole": "Polytechnique Montréal",
        "tasks": [
            "Corriger les défauts observés lors du projet précédent et les améliorer",
            "Concevoir une nouvelle interface utilisateur pour la version mobile avec Figma",
            "Apprendre le langage Dart pour réaliser le projet",
            "Développer une pipeline CI/CD sur Jenkins pour effectuer des tests automatisés et déployer l'application"
        ]
      },
      {
        "title": "Projet intégrateur final - Concours universitaire Ubisoft",
        "description": "Développer en équipe, en dix semaines, un prototype de jeu vidéo jouable en 3D répondant au thème, au mandat et aux contraintes définis par un jury composé de professionnels d’Ubisoft.",
        "keyWords": ["Unreal Engine", "Notion", "Jenkins", "Perforce"],
        "image": "",
        "video": "",
        "lienUrl": "https://lex0re.itch.io/noctambule",
        "start": "2024-01",
        "end": "2024-04",
        "ecole": "Polytechnique Montréal",
        "tasks": [
            "Travailler en équipe de 9 avec des rôles spécifiques selon les compétences (Programmeur, Game Designer, Artiste, Musicien), sous la supervision de mentors et professeurs",
            "Utiliser la méthodologie Agile avec des réunions hebdomadaires",
            "Développer le projet sur Unreal Engine en utilisant Blueprint",
            "Définir les tâches à accomplir selon leur difficulté sur Notion",
            "Mettre en place une pipeline CI/CD sur Jenkins pour effectuer des tests automatisés et déployer le jeu"
        ]
      },
      {
        "title": "Projet intégrateur - Conception d'un jeu en Java",
        "description": "Développer en équipe de trois un jeu en Java démontrant l'utilisation de la physique et des concepts associés.",
        "keyWords": ["Java", "GitLab"],
        "image": "",
        "video": "Projet Java.mp4",
        "lienUrl": "https://github.com/jammy312/Projet-Maisonneuve",
        "start": "2020-01",
        "end": "2020-05",
        "ecole": "Collège Maisonneuve",
        "tasks": [
            "Travailler en équipe de 3 pour déterminer quel jeu réaliser",
            "Partager le projet en Sprint afin de déterminer l'avancement du projet",
            "Faire des rencontres hebdomadaires selon la méthodologie Agile avec le professeur",
            "Faire des recherches sur internet afin de déterminer les formules physiques de la balle selon la collision entre les murs et la gravité qu'il traverse",
            "Faire des Playtest afin de déterminer la compréhension du jeux ainsi que de recevoir un retour"         
        ]
      },
      {
        "title": "Projet parascolaire - Conception d'un jeu sur Construct 3",
        "description": "Développer en équipe de 4 un jeu tout en apprenant un nouveau outil de programmation.",
        "keyWords": ["Construct 3", "PiskelApp"],
        "image": "",
        "video": "Memoria-of-the-fallen.mp4",
        "lienUrl": "https://github.com/jammy312/memoria-of-the-fallen",
        "start": "2017-10",
        "end": "2018-03",
        "ecole": "École secondaire Henri-Bourassa",
        "tasks": [
            "Créer les personnages avec PiskelApp (site désormais hors ligne)",
            "Déterminer le jeu à développer et les fonctionnalités à réaliser sur Trello",
            "Faire des playtests hebdomadaires avec les mentors et des volontaires",
            "Collaborer avec d'autres équipes pour une meilleure maîtrise de Construct 3 ainsi qu'un meilleur retour sur le jeu"
        ]
      },
      {
        "title": "Projet personnel - Maintenance d'un site Web",
        "description": "Assurer la maintenance d'un site web pour un professeur de l'École de Technologie Supérieure (ETS) en JavaScript.",
        "keyWords": ["JavaScript", "Google Drive", "Github"],
        "image": "",
        "video": "",
        "lienUrl": "",
        "start": "2021-09",
        "end": "2021-12",
        "tasks": [
            "En équipe de 3, déterminer les tâches à réaliser en fonction de leur urgence et difficulté",
            "Apprendre le langage JavaScript pour mener à bien le projet demandé par le professeur",
            "Modifier les couleurs de l'interface utilisateur pour améliorer l'esthétique de la page web",
            "Organiser des rencontres hebdomadaires pour effectuer des tests d'acceptation sur chaque fonctionnalité réalisée",
            "Améliorer ou modifier les fonctionnalités déja présentes dans l'application"
        ]
      },
      {
        "title": "Projet personnel - Création d'un site de planification d'événements",
        "description": "Planifier et réaliser un site web de planification d'événements en utilisant WordPress.",
        "keyWords": ["WordPress", "Google Drive"],
        "image": "",
        "video": "",
        "lienUrl": "",
        "start": "2020-06",
        "end": "2021-09",
        "tasks": [
          "Déterminer l'interface de l'application web sur figma", 
          "Déterminer quelle tâches seront à réaliser en premier sur Trello", 
          "Faire la revue d'interface réalisée par mes collègues", 
          "Faire des rencontres hebdomadaires avec le client afin de vérifier si les fonctionnalités créées correspond à ses attentes"]
      }
   ]
}
